Repository: angelochillemix/pmi-users-sync
Catalog: languages/pmi-user-sync-*.po
Languages: it

source: PMI Users
it: Utenti PMI

source: PMI Users Sync Settings
it: Impostazioni PMI Users Sync

source: Settings
it: Impostazioni

source: General Settings
it: Impostazioni Generali

source: Settings for PMI Users Sync plugin
it: Impostazioni per il plugin PMI User Sync

source: Users Loader Settings
it: Impostazioni del caricatore utenti

source: Settings for PMI Users loader
it: Impostazioni per il caricatore degli utenti PMI

source: If checked, the PMI ID inserted by the users will be overwritten
it: Se selezionato, il PMI ID inserito dall'utente verrà soprascritto

source: Role to set
it: Ruolo da impostare

source: Role to remove
it: Ruolo da rimuovere

source: PMI-ID custom field
it: PMI-ID campo personalizzato

source: Insert the PMI-ID custom field defined with ACF plugin (e.g. dbem_pmi_id)
it: Inserisci il PMI-ID campo personalizzato definito nel plugin ACF (ad es. dbem_pmi_id)

source: Memberships to set
it: Associazione da impostare

source: Memberships to remove
it: Associazione da rimuovere

source: Membership custom field
it: Campo personalizzato Associazione

source: Insert the Membership custom field defined with ACF plugin (e.g. dbem_membership)
it: Inserisci il campo personalizzato Associazione definito nel plugin ACF (ad es. dbem_pmi_id)

source: Synchonization schedule
it: Programmazione di sincronizzazione

source: The recurrence of the users loader that synchronizes the PMI-ID
it: La ricorrenza del caricatore degli utenti che sincronizza il PMI ID

source: Daily
it: Giornalmente

source: Weekly
it: Settimanalmente

source: Monthly
it: Mensilmente

source: Quarterly
it: Trimestralmente

source: Loader
it: Caricatore

source: The type of loader to use to load the PMI members
it: Il tipo di caricatore da usare per caricare i membri del PMI

source: The Excel file path with the PMI-ID extracted from PMI.</br>Once inserted, it just needs to be overwritten manually or by batch.</br>Insert the file if Excel file is selected in the <strong>Loader</strong> setting field.
it: Il file Excel con i PMI-ID estratti da PMI. </br>Una volta inserito, deve solo essere sovrascritto manualmente o tramite uno script. </br> Inserisci il file se Excel file è selezionato nell'impostazione del campo <strong>Caricatore</strong>.

source: Insert the Excel file path
it: Inserisci il percorso del file Excel

source: Set
it: Imposta

source: DEPService username
it: Nome utente per DEPService

source: The username to access the PMI DEPService. Contact your PMI Chapter Officer to get it.</br><strong>Note:</strong> Set the username if Web Service is selected in the <strong>Loader</strong> setting field
it: Il nome utente per accedere il servizio PMI DEPService. Contatta il direttore del PMI Chapter per ottenerlo.</br><strong>Nota:</strong> Imposta il nome utente se Web Service è selezionato nell'impostazione del campo <strong>Caricatore</strong>

source: Insert the username
it: Inserisci il nome utente

source: DEPService password
it: Password per DEPService

source: The password to access the PMI DEPService. Contact your PMI Chapter Officer to get it.</br><strong>Note:</strong> Set the password if Web Service is selected in the <strong>Loader</strong> setting field
it: Il password per accedere il servizio PMI DEPService. Contatta il direttore del PMI Chapter per ottenerlo.</br><strong>Nota:</strong> Imposta la password se Web Service è selezionato nell'impostazione del campo <strong>Caricatore</strong>

source: Insert the password
it: Inserisci la password

source: The user role to set if user is found member of PMI
it: Il ruolo utente impostato se l'utente è membro di PMI

source: The user role to remove if user is not found member of PMI
it: Il ruolo utente rimosso se l'utente non è membro di PMI

source: The user membership to set if user is found member of PMI
it: L'associazione dell'utente da impostare se l'utente è membro di PMI

source: The user membership to remove if user is not found member of PMI
it: L'associazione dell'utente da rimuovere se l'utente è membro di PMI

source: PMI-ID custom field does not exist. Update not done!
it: Il campo personalizzato PMI-ID non esiste. Aggiornamento non eseguito!

source: Membership custom field does not exist. Update not done!
it: Il campo personalizzato Associazione non esiste. Aggiornamento non eseguito!

source: Nonce failed!
it: Verifica fallita!

source: Synchronizing the PMI-ID of the users
it: Syncronizzazione dei PMI-ID degli utenti in corso

source: Users successfully updated!
it: Utente aggiornato con successo!

source: No synchronization occurred yet
it: Nessun evento avvenuto

source: An error occurred while reading the Excel file. Error is:
it: Un errore è stato riscontrato durante la lettura del file Excel. L'errore è

source: No file has been set in the plugin settings page or file does not exist.
it: File non impostato nella pagina delle impostazioni del plugin o il file non esiste.

source: An error occurred while retrieving the list of PMI members through the web service. Error is:
it: Un errore è stato riscontrato durante il recupero della lista dei membri PMI attraverso il Web Service. L'errore è:

source: An error occurred while retrieving the list of PMI members through the web service.
it: Un errore è stato riscontrato durante il recupero della lista dei membri PMI attraverso il Web Service.

source: An error occurred. Error is:
it: Errore riscontrato. L'errore è:

source: An error occurred
it: Errore riscontrato

source: An error occurred while rendering the page. Error is:
it: Un errore è stato riscontrato durante la creazione della pagina. L'errore è

source: An error occurred during the page rendering
it: Errore riscontrato durante la creazione della pagina

source: Last synchronization on:
it: Ultima sincronizzazione il

source: An error occurred while scheduling the cron for the synchronization of the PMI-ID. Error is:
it: Un errore è stato riscontrato durante la programmazione dell'evento cron di sinconizzazione del PMI ID. L'errore è:

source: Once a month
it: Una volta al mese

source: Every 2 minutes
it: Ogni 2 minuti

source: Every quarter
it: Ogni trimestre

source: ACF field for PMI-ID does not exist
it: Il campo ACF per PMI-ID non esiste

source: An error occurred while running the update. Error is:
it: Un errore è stato riscontrato durante l'aggiornamento programmato. L'errore è:

source: PMI-ID of user with email
it: PMI-ID dell'utente con email

source: updated to
it: aggiornato a

source: PMI-ID custom field does not exist, therefore not updated
it: Il campo personalizzato PMI-ID non esiste, quindi non aggiornato

source: for user with email
it: per utente con email

source: was not found
it: non è stato trovato

source: User with email
it: Utente con email

source: not overwritten
it: non sovrascritto

source: User
it: Utente

source: with email
it: con email

source: not registered to the site
it: non registrato al sito
